# 판다스
- 데이터 분석 및 조작 라이브러리

In [1]:
print("wtf!")

wtf!

In [5]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.expm1x)

2.3.1
<ufunc 'expm1'>

In [3]:
print(pd.__version__)

2.3.1

In [11]:
# 핵심 자료구조 시리즈와 데이터프레임
# 판다스의 인덱스는 라벨?
# 시리즈: 라벨이 붙은 1차원 배열
# 라벨 이름을 직접 지정가능

print("판다스의 시리즈")
data=[10,20,30,40,50]
s=pd.Series(data)
print(s)

print("인덱스 커스텀")
data=[10,20,30,40]
s=pd.Series(data,index=["a","b","c","d"])
print(s)

print("딕셔너리로 생성")
data={"서울":100,"부산":200,"대구":300}
s=pd.Series(data)
print(s)

판다스의 시리즈
0    10
1    20
2    30
3    40
4    50
dtype: int64
인덱스 커스텀
a    10
b    20
c    30
d    40
dtype: int64
딕셔너리로 생성
서울    100
부산    200
대구    300
dtype: int64

In [18]:
print("판다스 시리즈의 속성")
data=[10,20,30,40]
s=pd.Series(data,index=["a","b","c","d"])
print("values:",s.values)
print(s.index) # 인덱스도 하나의 데이터를 가지고 있다.
print("dtype:",s.dtype)
print("size:",s.size)
print("shape:",s.shape)
print("name:",s.name)

판다스 시리즈의 속성
values: [10 20 30 40]
Index(['a', 'b', 'c', 'd'], dtype='object')
dtype: int64
size: 4
shape: (4,)
name: None

In [24]:
# 시리즈의 연산
s1=pd.Series([10,20,30],index=["a","b","c"])
s2=pd.Series([5,6,7],index=["b","c","d"])

print(s1+s2)
print("\n겹치는 인덱스는 b와 c,\n인덱스가 같은 b와c끼리만 더했고\n겹치지않는 a,d는 연산불가로 Nan을 반환")

a     NaN
b    25.0
c    36.0
d     NaN
dtype: float64

겹치는 인덱스는 b와 c,
인덱스가 같은 b와c끼리만 더했고
겹치지않는 a,d는 연산불가로 Nan을 반환

In [27]:
# 정렬안된 인덱스간 연산
s1=pd.Series([10,20,30],index=["b","a","c"])
s2=pd.Series([5,6,7],index=["b","c","d"])

print(s1+s2)
print("\n정렬안된 인덱스도 알아서 정렬해줌")

a     NaN
b    15.0
c    36.0
d     NaN
dtype: float64

정렬안된 인덱스도 알아서 정렬해줌

In [31]:
# 브로드캐스팅
s1=pd.Series([5,10,15],index=["a","b","c"])
print(s1+3)
print(s1*4)

a     8
b    13
c    18
dtype: int64
a    20
b    40
c    60
dtype: int64

In [34]:
# 불리언 인덱싱
s=pd.Series([50,60,70,80,90,100],index=["a","b","c","d","e","f"])

mask=s>70
print(mask)
print(s[mask])

a    False
b    False
c    False
d     True
e     True
f     True
dtype: bool
d     80
e     90
f    100
dtype: int64

In [41]:
s=pd.Series([10,20,30],["a","b","c"])
a=np.array([1,2,3])
print("넘파이 배열과도 연산가능")
print(s+a)
i=[100,200,300]
print("\n파이썬 리스트도 연산가능")
print(s+i)

넘파이 배열과도 연산가능
a    11
b    22
c    33
dtype: int64

파이썬 리스트도 연산가능
a    110
b    220
c    330
dtype: int64

In [46]:
#1
a=pd.Series([1,2,3,4])
print(a.dtype,"\n")
#2
s1=pd.Series([3,5,7],index=['a','b','c'])
s2=pd.Series([10,20,30],index=['b','c','d'])
print(s1+s2,"\n")
#3
a=pd.Series([1,2,3,4,5])
a10=a+10
print(a10)

int64

a     NaN
b    15.0
c    27.0
d     NaN
dtype: float64

0    11
1    12
2    13
3    14
4    15
dtype: int64

# 데이터프레임

In [48]:
# 2차원 라벨 데이터 구조
# 시리즈를 모아놓은 것
# 행과 열에대해 라벨을 부여할 수 있다.

In [53]:
print("딕셔너리로 생성")
data={
    "name":["anna","banana","minion"],
    "naton":["france","america","japan"],
    "cidy":["paris","NYC","tokyo"]
}

df=pd.DataFrame(data)
print(df)

딕셔너리로 생성
     name    naton   cidy
0    anna   france  paris
1  banana  america    NYC
2  minion    japan  tokyo

In [ ]:
# 리스트의 리스트로 생성
data=[[1,"a"],[2,"b"],[3,"c"]]
df=pd.DataFrame(data)
print(df)

   0  1
0  1  a
1  2  b
2  3  c

In [57]:
data=[
    {"name":"nana","age":11,"city":"seoul"},
    {"name":"lulu","age":21,"city":"paris"},
    {"name":"nasus","age":3600,"city":"shurima"},
    {"name":"garen","age":4,"city":"demacia"}
]

df=pd.DataFrame(data)
print(df)

# 키가 컬럼, 값은 로우

    name   age     city
0   nana    11    seoul
1   lulu    21    paris
2  nasus  3600  shurima
3  garen     4  demacia

In [62]:
# 시리즈로 데이터프레임
s=pd.Series(["국","수","영"],index=["a","b","c"])
d=pd.Series([100,200,300],index=["a","b","c"])

df=pd.DataFrame({"과목":s,"점수":d})
print(df)

  과목   점수
a  국  100
b  수  200
c  영  300

In [64]:
data=[
    {"name":"nana","age":11,"city":"seoul"},
    {"name":"lulu","age":21,"city":"paris"},
    {"name":"nasus","age":3600,"city":"shurima"},
    {"name":"garen","age":4,"city":"demacia"}
]

df=pd.DataFrame(data)
print("shape:",df.shape)
print("columns:",df.columns)
print("index:",df.index)
print("dtypes:",df.dtypes)
print("values",df.values)

shape: (4, 3)
columns: Index(['name', 'age', 'city'], dtype='object')
index: RangeIndex(start=0, stop=4, step=1)
dtypes: name    object
age      int64
city    object
dtype: object
values [['nana' 11 'seoul']
 ['lulu' 21 'paris']
 ['nasus' 3600 'shurima']
 ['garen' 4 'demacia']]

1. 다음 데이터로 DataFrame을 생성하고, 컬럼명을 '이름', '나이', '도시'로 지정하세요.
• [['홍길동', 28, '서울'], ['김철수', 33, '부산'], ['이영희', 25, '대구']]
2. 아래와 같은 딕셔너리로 DataFrame을 생성하세요.
• {'A': [1, 2, 3], 'B': [4, 5, 6]}
3. 아래 데이터를 사용해 DataFrame을 만드세요.
• [{'과목': '수학', '점수': 90}, {'과목': '영어', '점수': 85}, {'과목': '과학', '점수': 95}]
4. 아래 데이터를 사용해 DataFrame을 생성하되, 인덱스를 ['학생1', '학생2', '학생3']으로 지정
하세요.
• {'이름': ['민수', '영희', '철수'], '점수': [80, 92, 77]}
2025-08-06

In [80]:
#1
a=[['홍길동', 28, '서울'], ['김철수', 33, '부산'], ['이영희', 25, '대구']]
df=pd.DataFrame(a,columns=["이름","나이","도시"])
print(df,"\n")
#2
a=({'A': [1, 2, 3], 'B': [4, 5, 6]})
df=pd.DataFrame(a)
print(df,"\n")
#3 리스트 안 딕셔너리
a=[{'과목': '수학', '점수': 90}, {'과목': '영어', '점수': 85}, {'과목': '과학', '점수': 95}]
df=pd.DataFrame(a)
print(df,"\n")
#4 
a={'이름': ['민수', '영희', '철수'], '점수': [80, 92, 77]}
df=pd.DataFrame(a,index=["학생1","학생2","학생3"])
print(df)

    이름  나이  도시
0  홍길동  28  서울
1  김철수  33  부산
2  이영희  25  대구

   A  B
0  1  4
1  2  5
2  3  6

   과목  점수
0  수학  90
1  영어  85
2  과학  95

     이름  점수
학생1  민수  80
학생2  영희  92
학생3  철수  77

아래 Series 객체 2개를 이용해 DataFrame을 만드세요.
•
6. 아래 딕셔너리로 DataFrame을 만들고, 컬럼 순서를 ['B', 'A']로 지정해 출력하세요.
• {'A': [1, 2], 'B': [3, 4]}
7. 데이터를 DataFrame으로 만들고, 컬럼명을 ['product', 'price', 'stock']으로 변경하세요.
• [['펜', 1000, 50], ['노트', 2000, 30]]
8. 아래 DataFrame을 생성한 뒤, '국가' 컬럼만 추출하세요.
• {'국가': ['한국', '일본', '미국'], '수도': ['서울', '도쿄', '워싱턴']}
2025-08-06

In [97]:
#5 
kor = pd.Series([90, 85, 80], index=['a', 'b', 'c'])
eng = pd.Series([95, 88, 82], index=['a', 'b', 'c'])
data={"한국어":kor,"영어":eng}
df=pd.DataFrame(data)
print(df,"\n")
#6 콜름 순서를 명시적으로 바꾸었다
data={'A': [1, 2], 'B': [3, 4]}
df=pd.DataFrame(data,columns=["B","A"])
print(df,"\n")
#7
data=[['펜', 1000, 50], ['노트', 2000, 30]]
df=pd.DataFrame(data,columns=["product","price","stock"])
print(df,"\n")
#8
data={'국가': ['한국', '일본', '미국'], '수도': ['서울', '도쿄', '워싱턴']}
df=pd.DataFrame(data)
print(df)
df["국가"]

   한국어  영어
a   90  95
b   85  88
c   80  82

   B  A
0  3  1
1  4  2

  product  price  stock
0       펜   1000     50
1      노트   2000     30

   국가   수도
0  한국   서울
1  일본   도쿄
2  미국  워싱턴

0    한국
1    일본
2    미국
Name: 국가, dtype: object

In [120]:
a=[['홍길동', 28, '서울'], ['김철수', 33, '부산'], ['이영희', 25, '서울'],['김동동',19,'김천'],['정송송',40,'원주']]
df=pd.DataFrame(a,columns=["이름","나이","도시"])

df.head()
df.head(3) #앞에 3개만

    이름  나이  도시
0  홍길동  28  서울
1  김철수  33  부산
2  이영희  25  서울

In [121]:
df.tail()
df.tail(3) #뒤에 3개만

    이름  나이  도시
2  이영희  25  서울
3  김동동  19  김천
4  정송송  40  원주

In [122]:
df.info() #정보 출력

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      5 non-null      object
 1   나이      5 non-null      int64
 2   도시      5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [124]:
# 통계적인 수치를 출력. 기본적으로 수치형 콜름만 출력
df.describe() 
# 오브젝트를 찍으면 문자열 부분도 요약한다
df.describe(include="object")
# 전체적으로 보여줌 모든컬럼을
df.describe(include="all")

         이름         나이   도시
count     5   5.000000    5
unique    5        NaN    4
top     홍길동        NaN   서울
freq      1        NaN    2
mean    NaN  29.000000  NaN
std     NaN   7.968689  NaN
min     NaN  19.000000  NaN
25%     NaN  25.000000  NaN
50%     NaN  28.000000  NaN
75%     NaN  33.000000  NaN
max     NaN  40.000000  NaN

# 판다스는 기본문법이 넘파이와 닮았다.

In [ ]:
# 인덱싱과 슬라이싱
df["이름"]
# 컬럼 1개: 시리즈.
# 하나의 시리즈를 선택한다

df[["이름","나이"]]
# 여러개를 선택할 수도 있다.

    이름  나이
0  홍길동  28
1  김철수  33
2  이영희  25
3  김동동  19
4  정송송  40

# 어렵고 중요한 슬라이싱

In [150]:
a=[['홍길동', 28, '서울'], ['김철수', 33, '부산'], ['이영희', 25, '서울'],['김동동',19,'김천'],['정송송',40,'원주']]
df=pd.DataFrame(a,columns=["이름","나이","도시"])

df[1:4] #기본적으로 행을 자른다

df[1:4]["이름"] #슬라이싱 후 인덱싱

df[-3:] # 뒤에것 역순출력

df[0:1]
# 슬라이싱은 행 기준으로 작동. 열기준은 별도의 방법사용이 필수!!!

    이름  나이  도시
0  홍길동  28  서울

# iloc, loc
- 이름 예쁘다
- intiger location
- 정수 위치 기반 인덱싱, 슬라이싱

# iloc은 인덱싱기준
# loc은 저거뭐냐 그거기준

In [159]:
a=[['홍길동', 28, '서울'], ['김철수', 33, '부산'], ['이영희', 25, '서울'],['김동동',19,'김천'],['정송송',40,'원주']]
df=pd.DataFrame(a,columns=["이름","나이","도시"])

print(df.iloc[0],"\n")  #첫번째 행이 나온다
print(df.head(1))
print("\n")
print(df.iloc[:,2])

이름    홍길동
나이     28
도시     서울
Name: 0, dtype: object

    이름  나이  도시
0  홍길동  28  서울


0    서울
1    부산
2    서울
3    김천
4    원주
Name: 도시, dtype: object

In [ ]:
df.iloc[1:4]
df.iloc[:,0:2]

df.iloc[[0,2,4]] #팬시인덱싱. 불리언인덱싱역시 가능하다
df.iloc[:,[1,2]]
df.iloc[[0,2,4],[1,2]]

   나이  도시
0  28  서울
2  25  서울
4  40  원주

In [167]:
# 음수 인덱스
df.iloc[-1] # 제일 마지막 행

이름    정송송
나이     40
도시     원주
Name: 4, dtype: object

In [168]:
df.loc[:,"이름"]

0    홍길동
1    김철수
2    이영희
3    김동동
4    정송송
Name: 이름, dtype: object

In [177]:
df.loc[2:4,["이름","도시"]]
# 라벨 이름 기준으로 인덱싱

mask=df["나이"]>=30
print(mask,"\n")
print(df[mask])

0    False
1     True
2    False
3    False
4     True
Name: 나이, dtype: bool

    이름  나이  도시
1  김철수  33  부산
4  정송송  40  원주

In [1]:
# 행에 라벨이 있을 경우 라벨을 이용해서 인덱싱/슬라이싱 가능
# 라벨이 있으면 로케이션 쓰자

In [7]:
### iloc, loc
import pandas as pd
import numpy as np
data = {
    "이름": ["홍길동", "이순신", "김유신", "강감찬", "장보고", "이방원"],
    "나이": [23, 35, 31, 40, 28, 34],
    "직업": ["학생", "군인", "장군", "장군", "상인", "왕자"]
}

df = pd.DataFrame(data)
# iloc 
# Interger Location
# 정수 위치 기반의 인덱싱, 슬라이싱
# NumPy의 슬라이싱과 유사함(거의 같음)!!!

# 단일 행/열 선택
df.iloc[:0] # 첫번째 행
df.iloc[:, 1] # 두번째 열

# 여러 행/열 동시 선택
df.iloc[1:4]
df.iloc[:, 0:2]
df.iloc[1:4, 0:2]

# fancy indexing
df.iloc[[0,2,4]]
df.iloc[:,[1,2]]
df.iloc[[0,2,4],[1,2]]

# 음수 인덱스 슬라이싱
df.iloc[-1]
df.iloc[:,-2:]

# loc
# location의 약자
# 라벨의 이름 기준으로 인덱싱/슬라이싱
# 단일 행/열 선택
df.loc[0]
df.loc[:,"이름"]

# 여러 행/열 선택
df.loc[2:4, ["이름","직업"]]

# 조건식
mask = df["나이"] >= 30
df.loc[mask, ["이름","나이"]]

s1 = pd.Series(["국어","수학","영어"], index=["a","b","c"])
s2 = pd.Series([100,90,85], index=["a","b","c"])
df = pd.DataFrame({"과목": s1, "점수": s2})
df

# 행에 라벨이 있을 경우 라벨을 이용해서 인덱싱/슬라이싱 가능
df.loc[["a","c"],["과목"]]

   과목
a  국어
c  영어

실습3. DataFrame 연습(2)
1. iloc을 사용해 인덱스 2~5(포함 안함) 행, 1~3(포함 안함) 열만 선택해 출력하세요.
2. loc을 사용해 인덱스 3~6(포함!) 행, '이름'과 '점수' 컬럼만 출력하세요.
3. iloc을 사용해, 마지막 3개 행의 '직업'과 '점수' 컬럼만 선택해 출력하세요.
4. iloc을 사용해, 홀수번째(1, 3, 5, 7번 인덱스) 행, 모든 열을 선택하세요.
5. loc을 사용해, 인덱스 4~7번 행, '나이', '점수' 컬럼만 출력하세요.
6. iloc을 사용해, 짝수번째(0,2,4,6) 행과 짝수번째(0,2) 열만 선택하세요

In [27]:
data = {
    "이름": ["홍길동", "이순신", "김유신", "강감찬", "장보고", "이방원","최무선","정도전"],
    "나이": [23, 35, 31, 40, 28, 34,42,29],
    "직업": ["학생", "군인", "장군", "장군", "상인", "왕자","과학자","정치가"],
    "점수": [85,90,75,88,92,95,87,83]
}
df = pd.DataFrame(data)
print(df,"\n")
#2,3,4행의 나이, 직업 출력
print(df.iloc[2:5,1:3],"\n") 
#3,4,5,6행에서 이름과 점수만 출력
print(df.loc[3:6,["이름","점수"]],"\n")
# 마지막 3개행의 직업(2), 점수(3)
print(df.iloc[-3:,[2,3]],"\n")
# 홀수번 인덱스()
mask=df.index%2==1
print(df.iloc[mask,:])
print(df.iloc[[1,3,5,7]],"\n")
# 인덱스 4~7, 나이점수
print(df.loc[4:7,["나이","점수"]])
# 짝수번째 행과 짝수번째 열
print(df.iloc[[0,2,4,6],[0,2]])

    이름  나이   직업  점수
0  홍길동  23   학생  85
1  이순신  35   군인  90
2  김유신  31   장군  75
3  강감찬  40   장군  88
4  장보고  28   상인  92
5  이방원  34   왕자  95
6  최무선  42  과학자  87
7  정도전  29  정치가  83

   나이  직업
2  31  장군
3  40  장군
4  28  상인

    이름  점수
3  강감찬  88
4  장보고  92
5  이방원  95
6  최무선  87

    직업  점수
5   왕자  95
6  과학자  87
7  정치가  83

    이름  나이   직업  점수
1  이순신  35   군인  90
3  강감찬  40   장군  88
5  이방원  34   왕자  95
7  정도전  29  정치가  83
    이름  나이   직업  점수
1  이순신  35   군인  90
3  강감찬  40   장군  88
5  이방원  34   왕자  95
7  정도전  29  정치가  83

   나이  점수
4  28  92
5  34  95
6  42  87
7  29  83
    이름   직업
0  홍길동   학생
2  김유신   장군
4  장보고   상인
6  최무선  과학자

loc location의 약자
- 이름기준으로 인덱싱 슬라이싱
- 단일 행열선택
- 시작끝모두포함
- 음수인덱스사용이안됨
- 라벨에 있는걸로 함
- df.loc[2:4,["라벨":"라벨"]]